<a href="https://colab.research.google.com/github/JakeOh/202103_itw_pyda_wkd/blob/main/da11_movielens.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# 데이터 프레임 merge

In [4]:
emp = pd.DataFrame({'empno': np.arange(1, 6),
                    'empname': ['a', 'b', 'c', 'd', 'e'],
                    'deptno': [10, 20, 30, 10, 50]})
emp

   empno empname  deptno
0      1       a      10
1      2       b      20
2      3       c      30
3      4       d      10
4      5       e      50

In [3]:
dept = pd.DataFrame({'deptno': np.arange(10, 50, 10),
                     'deptname': ['HR', 'IT', 'Sales', 'Account']})
dept

   deptno deptname
0      10       HR
1      20       IT
2      30    Sales
3      40  Account

In [5]:
pd.merge(left=emp, right=dept)
# how 파라미터: inner, left, right, outer. 기본값은 inner.

   empno empname  deptno deptname
0      1       a      10       HR
1      4       d      10       HR
2      2       b      20       IT
3      3       c      30    Sales

In [6]:
pd.merge(left=emp, right=dept, how='left')  # left (outer) join

   empno empname  deptno deptname
0      1       a      10       HR
1      2       b      20       IT
2      3       c      30    Sales
3      4       d      10       HR
4      5       e      50      NaN

In [7]:
pd.merge(left=emp, right=dept, how='right')  # right (outer) join

   empno empname  deptno deptname
0    1.0       a      10       HR
1    4.0       d      10       HR
2    2.0       b      20       IT
3    3.0       c      30    Sales
4    NaN     NaN      40  Account

In [8]:
pd.merge(left=emp, right=dept, how='outer')  # full (outer) join

   empno empname  deptno deptname
0    1.0       a      10       HR
1    4.0       d      10       HR
2    2.0       b      20       IT
3    3.0       c      30    Sales
4    5.0       e      50      NaN
5    NaN     NaN      40  Account